interface StringDictionary {
  [key: string]: string | string[];
}

export const knyhySZ: StringDictionary[] = [
  {
    but: 'Буття',
    vyh: 'Вихід',
    lev: 'Левіт',
    chs: 'Числа',
    vtz: 'Второзаконня',
  },
  {
    nav: 'Ісуса Навина',
    sud: 'Суддів',
    rut: 'Рути',
    sam1: 'I Самуїла',
    sam2: 'II Самуїла',
    car1: 'I Царів',
    car2: 'II Царів',
    hr1: 'I Хронік',
    hr2: 'II Хронік',
    ezry: 'Езри',
    neem: 'Неємії',
    tov: 'Товита',
    jdt: 'Юдити',
    est: 'Естери',
    mak1: 'I Макавеїв',
    mak2: 'II Макавеїв',
  },
  {
    iov: 'Іова',
    psal: 'Псалмів',
    pryp: 'Приповідок',
    prp: 'Проповідника',
    pisn: 'Пісні Пісень',
    mudr: 'Мудрости',
    syr: 'Сираха',
  },
  {
    isaj: 'Ісаї',
    jer: 'Єремії',
    pla: 'Плач Єремії',
    var: 'Варуха',
    lyst: 'Лист Єремії',
    jez: 'Єзекиїла',
    dan: 'Даниїла',
    osija: 'Осії',
    joil: 'Йоіла',
    amos: 'Амоса',
    avd: 'Авдія',
    jona: 'Йони',
    mih: 'Міхея',
    naum: 'Наума',
    avak: 'Авакума',
    sof: 'Софонії',
    agg: 'Аггея',
    zah: 'Захарії',
    mal: 'Малахії',
  },
];

export const knyhyNZ: StringDictionary[] = [
  {
    mat: ['від Матея', 'Євангеліє від Матея'],
    mar: ['від Марка', 'Євангеліє від Марка'],
    luk: ['від Луки', 'Євангеліє від Луки'],
    ioan: ['від Йоана', 'Євангеліє від Йоана'],
  },
  {
    dij: 'Діяння апостолів',
  },
  {
    rym: ['до Римлян', 'Послання Ап. Павла до Римлян'],
    kor1: ['I до Корінтян', 'I Послання Ап. Павла до Корінтян'],
    kor2: ['II до Корінтян', 'II Послання Ап. Павла до Корінтян'],
    gal: ['до Галатів', 'Послання Ап. Павла до Галатів'],
    efes: ['до Ефесян', 'Послання Ап. Павла до Ефесян'],
    fyl: ['до Филип&apos;ян', 'Послання Ап. Павла до Филип&apos;ян'],
    kol: ['до Колосян', 'Послання Ап. Павла до Колосян'],
    sol1: ['I Солунян', 'I Послання Ап. Павла до Солунян'],
    sol2: ['II Солунян', 'II Послання Ап. Павла до Солунян'],
    tym1: ['I до Тимотея', 'I Послання Ап. Павла до Тимотея'],
    tym2: ['II до Тимотея', 'II Послання Ап. Павла до Тимотея'],
    tyt: ['до Тита', 'Послання Ап. Павла до Тита'],
    flm: ['до Филимона', 'Послання Ап. Павла до Филимона'],
    evr: ['до Євреїв', 'Послання Ап. Павла до Євреїв'],
  },
  {
    jak: ['Ап. Якова', 'Послання Ап. Якова'],
  },
  {
    pet1: ['Перше', 'Перше послання Ап. Петра'],
    pet2: ['Друге', 'Друге послання Ап. Петра'],
  },
  {
    iva1: ['Перше', 'Перше послання Ап. Йоана'],
    iva2: ['Друге', 'Друге послання Ап. Йоана'],
    iva3: ['Третє', 'Третє послання Ап. Йоана'],
  },
  {
    jud: ['Ап. Юди', 'Послання Ап. Юди'],
  },
  {
    odkr: 'Одкровення Йоана',
  },
];

const knyhyArr = [...knyhySZ, ...knyhyNZ];
export let knyhy: StringDictionary = {};
knyhyArr.forEach((kn) => {
  knyhy = { ...knyhy, ...kn };
});
